--------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\Diego\Desktop\facu\Decimo semestre\Macroeconomía aplicada\Task 4
> \log.txt
  log type:  text
 opened on:   3 Mar 2023, 15:30:41

. /*
> Date: 03/03/2023
> Autor: Diego Ariel Soto Díaz
> ID: 1797743
> Subject: Applied Macroeconomics
> Task: VAR model
> */
. 
. use usmacro.dta

. 
. ***************************************************
. ********** PART 1: Test for stationarity **********
. ***************************************************
. dfuller dlrinv, trend lags(12)

Augmented Dickey-Fuller test for unit root         Number of obs   =       174

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -5.043            -4.015            -3.440            -3.140
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.0002

. dfuller dlrinv, lags(12)

Augmented Dickey-Fuller test for unit root         Number of obs   =       174

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -5.056            -3.485            -2.885            -2.575
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.0000

. 
. dfuller dlrgdp, trend lags(12)

Augmented Dickey-Fuller test for unit root         Number of obs   =       174

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -4.574            -4.015            -3.440            -3.140
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.0011

. dfuller dlrgdp, lags(12)

Augmented Dickey-Fuller test for unit root         Number of obs   =       174

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -4.389            -3.485            -2.885            -2.575
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.0003

. 
. dfuller dlrcons, trend lags(12)

Augmented Dickey-Fuller test for unit root         Number of obs   =       174

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -3.928            -4.015            -3.440            -3.140
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.0111

. dfuller dlrcons, lags(12)

Augmented Dickey-Fuller test for unit root         Number of obs   =       174

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -3.876            -3.485            -2.885            -2.575
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.0022

. 
. /* 
> The three variables have a p-value lower than .05 so we can reject the null hypothes
> is of non-stationarity. Or if the test statistic value is more negative than critica
> l values also means stationarity. 
> All three are stationary. 
> */
. 
. ************************************************
. ********** PART 2: Optimal lag lenght **********
. ************************************************
. tsset time
        time variable:  time, 1959q1 to 2005q4
                delta:  1 quarter

. 
. varsoc dlrinv dlrgdp dlrcons, maxlag(12)

   Selection-order criteria
   Sample:  1962q2 - 2005q4                     Number of obs      =       175
  +---------------------------------------------------------------------------+
  |lag |    LL      LR      df    p      FPE       AIC      HQIC      SBIC    |
  |----+----------------------------------------------------------------------|
  |  0 | -645.462                      .331995     7.411     7.433   7.46525  |
  |  1 | -610.406  70.112    9  0.000  .246499   7.11321   7.20124*  7.33023* |
  |  2 |  -601.62  17.573    9  0.040  .247127   7.11565    7.2697   7.49543  |
  |  3 |  -593.73  15.779    9  0.072  .250345   7.12834   7.34841   7.67087  |
  |  4 | -587.617  12.225    9  0.201   .25886   7.16134   7.44743   7.86664  |
  |  5 | -576.117      23    9  0.006  .251749   7.13277   7.48488   8.00083  |
  |  6 | -563.182  25.871*   9  0.002  .240927*  7.08779*  7.50592   8.11861  |
  |  7 | -559.091  8.1815    9  0.516  .255197    7.1439   7.62805   8.33747  |
  |  8 | -550.805  16.572    9  0.056  .257774   7.15206   7.70223   8.50839  |
  |  9 | -544.611  12.388    9  0.192  .266818   7.18412   7.80031   8.70322  |
  | 10 | -538.464  12.294    9  0.197  .276492   7.21673   7.89894   8.89858  |
  | 11 | -534.379  8.1683    9  0.517  .293548   7.27291   8.02114   9.11753  |
  | 12 | -529.301  10.157    9  0.338  .308362   7.31772   8.13197    9.3251  |
  +---------------------------------------------------------------------------+
   Endogenous:  dlrinv dlrgdp dlrcons
    Exogenous:  _cons

. 
. /* 
> According to the Akaike Information Criteria (AIC), the optimal number of lags is 6.
> According to the Hannan-Quinn Information Criteria (HQIC) and the Schwarz Bayesian I
> nformation Criteria (SBIC), the optimal number of lags is 1. 
> 
> We test both for autocorrelation to decide which will we keep.
> */
. 
. /* 6 lags */
. var dlrinv dlrgdp dlrcons, lags(1/6)

Vector autoregression

Sample:  1960q4 - 2005q4                        Number of obs     =        181
Log likelihood =  -595.1042                     AIC               =   7.205571
FPE            =   .2709742                     HQIC              =   7.613936
Det(Sigma_ml)  =   .1440068                     SBIC              =   8.212832

Equation           Parms      RMSE     R-sq      chi2     P>chi2
----------------------------------------------------------------
dlrinv               19      1.6595   0.3240    86.7694   0.0000
dlrgdp               19      .74305   0.3175   84.21454   0.0000
dlrcons              19     .659355   0.1531   32.72376   0.0180
----------------------------------------------------------------

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
dlrinv       |
      dlrinv |
         L1. |   .2063314   .0938619     2.20   0.028     .0223655    .3902972
         L2. |   .0861569   .0977694     0.88   0.378    -.1054676    .2777813
         L3. |  -.2008782   .0991036    -2.03   0.043    -.3951177   -.0066387
         L4. |   .1522449    .099154     1.54   0.125    -.0420934    .3465832
         L5. |    .239754   .0990884     2.42   0.016     .0455444    .4339637
         L6. |   .1272853    .099394     1.28   0.200    -.0675235     .322094
             |
      dlrgdp |
         L1. |   .1414824   .2530818     0.56   0.576    -.3545488    .6375135
         L2. |   .1466855   .2567418     0.57   0.568    -.3565192    .6498902
         L3. |   .0575081   .2505822     0.23   0.818     -.433624    .5486403
         L4. |  -.2971813   .2428788    -1.22   0.221     -.773215    .1788524
         L5. |  -.4719452   .2413215    -1.96   0.051    -.9449266    .0010362
         L6. |  -.8645394   .2252883    -3.84   0.000    -1.306096   -.4229825
             |
     dlrcons |
         L1. |   .4567163   .2578262     1.77   0.076    -.0486138    .9620463
         L2. |   .0157759   .2644088     0.06   0.952    -.5024559    .5340076
         L3. |   .2963489   .2615056     1.13   0.257    -.2161927    .8088905
         L4. |    .260005   .2615602     0.99   0.320    -.2526435    .7726536
         L5. |   .0292738   .2595157     0.11   0.910    -.4793676    .5379152
         L6. |   .3621748   .2456267     1.47   0.140    -.1192447    .8435943
             |
       _cons |   .1659434   .3737817     0.44   0.657    -.5666552     .898542
-------------+----------------------------------------------------------------
dlrgdp       |
      dlrinv |
         L1. |   .1503478   .0420272     3.58   0.000     .0679759    .2327196
         L2. |   .0453331   .0437769     1.04   0.300    -.0404679    .1311342
         L3. |  -.1124438   .0443743    -2.53   0.011    -.1994158   -.0254719
         L4. |   .0530896   .0443968     1.20   0.232    -.0339266    .1401058
         L5. |  -.0227628   .0443674    -0.51   0.608    -.1097214    .0641958
         L6. |   .0347808   .0445043     0.78   0.434     -.052446    .1220077
             |
      dlrgdp |
         L1. |  -.1827716    .113319    -1.61   0.107    -.4048726    .0393295
         L2. |  -.0568253   .1149578    -0.49   0.621    -.2821384    .1684878
         L3. |  -.0697697   .1121998    -0.62   0.534    -.2896772    .1501378
         L4. |  -.1211029   .1087505    -1.11   0.265      -.33425    .0920442
         L5. |  -.1481832   .1080532    -1.37   0.170    -.3599636    .0635973
         L6. |  -.1555549   .1008742    -1.54   0.123    -.3532648    .0421549
             |
     dlrcons |
         L1. |   .3529738   .1154433     3.06   0.002     .1267091    .5792385
         L2. |   .1670098   .1183907     1.41   0.158    -.0650317    .3990514
         L3. |   .1676035   .1170908     1.43   0.152    -.0618902    .3970973
         L4. |   .2205926   .1171152     1.88   0.060    -.0089491    .4501342
         L5. |   .0762089   .1161998     0.66   0.512    -.1515385    .3039563
         L6. |   .1069417   .1099809     0.97   0.331     -.108617    .3225003
             |
       _cons |   .3486516   .1673631     2.08   0.037      .020626    .6766773
-------------+----------------------------------------------------------------
dlrcons      |
      dlrinv |
         L1. |   .0144714   .0372934     0.39   0.698    -.0586223    .0875651
         L2. |  -.0422109   .0388459    -1.09   0.277    -.1183475    .0339258
         L3. |  -.0442178   .0393761    -1.12   0.261    -.1213934    .0329579
         L4. |   .0816162   .0393961     2.07   0.038     .0044013    .1588311
         L5. |    .055246     .03937     1.40   0.161    -.0219177    .1324098
         L6. |  -.0222237   .0394915    -0.56   0.574    -.0996255    .0551782
             |
      dlrgdp |
         L1. |   .1514437    .100555     1.51   0.132    -.0456404    .3485279
         L2. |   .1052251   .1020092     1.03   0.302    -.0947093    .3051594
         L3. |  -.1135586   .0995619    -1.14   0.254    -.3086963    .0815791
         L4. |  -.1721335   .0965011    -1.78   0.074    -.3612723    .0170052
         L5. |  -.0300825   .0958824    -0.31   0.754    -.2180085    .1578434
         L6. |  -.0553025    .089512    -0.62   0.537    -.2307428    .1201379
             |
     dlrcons |
         L1. |  -.0190308   .1024401    -0.19   0.853    -.2198096     .181748
         L2. |   .1675693   .1050555     1.60   0.111    -.0383357    .3734743
         L3. |   .2173539    .103902     2.09   0.036     .0137098    .4209981
         L4. |   .0500539   .1039237     0.48   0.630    -.1536328    .2537405
         L5. |  -.0708227   .1031113    -0.69   0.492    -.2729172    .1312718
         L6. |   .0717348   .0975929     0.74   0.462    -.1195438    .2630134
             |
       _cons |   .5802631   .1485117     3.91   0.000     .2891854    .8713407
------------------------------------------------------------------------------

. 
. predict r_dlrinv, r eq(dlrinv)
(7 missing values generated)

. predict r_dlrgdp, r eq(dlrgdp)
(7 missing values generated)

. predict r_dlrcons, r eq(dlrcons)
(7 missing values generated)

. 
. corrgram r_dlrinv, lags(20)

                                          -1       0       1 -1       0       1
 LAG       AC       PAC      Q     Prob>Q  [Autocorrelation]  [Partial Autocor]
-------------------------------------------------------------------------------
1       -0.0122  -0.0122   .02727  0.8688          |                  |        
2        0.0095   0.0093   .04391  0.9783          |                  |        
3        0.0444   0.0450    .4107  0.9380          |                  |        
4        0.0704   0.0723    1.338  0.8549          |                  |        
5       -0.0317  -0.0298   1.5272  0.9099          |                  |        
6        0.0328   0.0287   1.7308  0.9427          |                  |        
7        0.0682   0.0669   2.6163  0.9181          |                  |        
8       -0.1706  -0.1783   8.1878  0.4153         -|                 -|        
9       -0.0258  -0.0343   8.3155  0.5027          |                  |        
10       0.0570   0.0614   8.9456  0.5373          |                  |        
11      -0.1061  -0.1108    11.14  0.4316          |                  |        
12      -0.0948  -0.0888     12.9  0.3764          |                  |        
13      -0.1091  -0.1257   15.247  0.2922          |                 -|        
14      -0.1445  -0.1650   19.386  0.1507         -|                 -|        
15       0.0017   0.0373   19.386  0.1968          |                  |        
16       0.1168   0.1252   22.125  0.1392          |                  |-       
17      -0.0400  -0.0290   22.447  0.1681          |                  |        
18      -0.0160   0.0302   22.499  0.2106          |                  |        
19      -0.0192  -0.0493   22.575  0.2566          |                  |        
20       0.0127  -0.0336   22.608  0.3084          |                  |        

. corrgram r_dlrgdp, lags(20)

                                          -1       0       1 -1       0       1
 LAG       AC       PAC      Q     Prob>Q  [Autocorrelation]  [Partial Autocor]
-------------------------------------------------------------------------------
1       -0.0168  -0.0168   .05174  0.8201          |                  |        
2       -0.0127  -0.0133   .08176  0.9599          |                  |        
3        0.0313   0.0314   .26453  0.9666          |                  |        
4        0.0564   0.0590   .85948  0.9303          |                  |        
5       -0.0397  -0.0345   1.1557  0.9491          |                  |        
6        0.0555   0.0536    1.739  0.9421          |                  |        
7        0.0623   0.0619   2.4768  0.9288          |                  |        
8       -0.0337  -0.0282   2.6946  0.9520          |                  |        
9       -0.0389  -0.0401   2.9859  0.9649          |                  |        
10       0.0740   0.0604   4.0452  0.9453          |                  |        
11       0.0595   0.0662   4.7345  0.9433          |                  |        
12      -0.0373  -0.0221   5.0077  0.9577          |                  |        
13       0.0515   0.0418    5.531  0.9616          |                  |        
14      -0.0888  -0.1002   7.0952  0.9310          |                  |        
15      -0.0828  -0.0816   8.4623  0.9039          |                  |        
16       0.1476   0.1480   12.837  0.6846          |-                 |-       
17      -0.0115  -0.0225   12.864  0.7452          |                  |        
18       0.0535   0.0845   13.446  0.7644          |                  |        
19      -0.0039   0.0026   13.449  0.8148          |                  |        
20       0.0134  -0.0006   13.486  0.8556          |                  |        

. corrgram r_dlrcons, lags(20)

                                          -1       0       1 -1       0       1
 LAG       AC       PAC      Q     Prob>Q  [Autocorrelation]  [Partial Autocor]
-------------------------------------------------------------------------------
1       -0.0125  -0.0125   .02866  0.8656          |                  |        
2       -0.0074  -0.0076   .03874  0.9808          |                  |        
3        0.0408   0.0408   .34842  0.9507          |                  |        
4        0.0088   0.0097   .36298  0.9854          |                  |        
5        0.0193   0.0205    .4334  0.9944          |                  |        
6        0.0556   0.0548   1.0177  0.9849          |                  |        
7       -0.0188  -0.0182   1.0852  0.9933          |                  |        
8       -0.1475  -0.1507   5.2509  0.7305         -|                 -|        
9       -0.0703  -0.0823   6.2022  0.7195          |                  |        
10       0.0435   0.0409   6.5682  0.7655          |                  |        
11      -0.0194  -0.0074   6.6419  0.8273          |                  |        
12      -0.0451  -0.0395   7.0405  0.8549          |                  |        
13       0.0072   0.0118   7.0507  0.8995          |                  |        
14      -0.1566  -0.1469   11.912  0.6134         -|                 -|        
15       0.0221   0.0215   12.009  0.6783          |                  |        
16       0.1606   0.1385   17.188  0.3735          |-                 |-       
17      -0.0473  -0.0462   17.639  0.4119          |                  |        
18       0.0603   0.0771   18.378  0.4311          |                  |        
19      -0.0767  -0.1029    19.58  0.4202          |                  |        
20      -0.0721  -0.0830   20.648  0.4181          |                  |        

. 
. drop r_dlrinv r_dlrcons r_dlrgdp

. 
. ** No evidence of serial correlation (autocorrelation) for either residual **
. 
. /* 1 lag */
. var dlrinv dlrgdp dlrcons, lags(1)

Vector autoregression

Sample:  1959q3 - 2005q4                        Number of obs     =        186
Log likelihood =  -663.6117                     AIC               =   7.264642
FPE            =   .2868004                     HQIC              =   7.348978
Det(Sigma_ml)  =   .2520769                     SBIC              =   7.472755

Equation           Parms      RMSE     R-sq      chi2     P>chi2
----------------------------------------------------------------
dlrinv                4     1.74802   0.1872   42.85166   0.0000
dlrgdp                4     .781809   0.1834   41.77767   0.0000
dlrcons               4     .660029   0.0757   15.22702   0.0016
----------------------------------------------------------------

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
dlrinv       |
      dlrinv |
         L1. |   .2339028   .0946196     2.47   0.013     .0484518    .4193539
             |
      dlrgdp |
         L1. |   .1986612   .2240449     0.89   0.375    -.2404588    .6377812
             |
     dlrcons |
         L1. |   .4867042   .2470233     1.97   0.049     .0025475    .9708609
             |
       _cons |   .0213872   .2213019     0.10   0.923    -.4123566    .4551309
-------------+----------------------------------------------------------------
dlrgdp       |
      dlrinv |
         L1. |   .1467087   .0423189     3.47   0.001     .0637651    .2296523
             |
      dlrgdp |
         L1. |  -.1483865   .1002048    -1.48   0.139    -.3447843    .0480114
             |
     dlrcons |
         L1. |   .3383945    .110482     3.06   0.002     .1218539    .5549352
             |
       _cons |   .5223515    .098978     5.28   0.000     .3283582    .7163448
-------------+----------------------------------------------------------------
dlrcons      |
      dlrinv |
         L1. |   .0242916    .035727     0.68   0.497    -.0457321    .0943153
             |
      dlrgdp |
         L1. |   .1861704   .0845962     2.20   0.028     .0203649    .3519759
             |
     dlrcons |
         L1. |  -.0219857   .0932725    -0.24   0.814    -.2047965    .1608251
             |
       _cons |   .7264548   .0835605     8.69   0.000     .5626793    .8902304
------------------------------------------------------------------------------

. 
. predict r_dlrinv, r eq(dlrinv)
(2 missing values generated)

. predict r_dlrgdp, r eq(dlrgdp)
(2 missing values generated)

. predict r_dlrcons, r eq(dlrcons)
(2 missing values generated)

. 
. corrgram r_dlrinv, lags(20)

                                          -1       0       1 -1       0       1
 LAG       AC       PAC      Q     Prob>Q  [Autocorrelation]  [Partial Autocor]
-------------------------------------------------------------------------------
1       -0.0501  -0.0501   .47538  0.4905          |                  |        
2        0.1130   0.1105   2.9007  0.2345          |                  |        
3       -0.0802  -0.0716   4.1305  0.2477          |                  |        
4        0.1202   0.1069   6.9073  0.1409          |                  |        
5        0.0864   0.1148   8.3499  0.1380          |                  |        
6        0.0088  -0.0159   8.3648  0.2126          |                  |        
7       -0.0115  -0.0165   8.3907  0.2994          |                  |        
8       -0.2594  -0.2689   21.611  0.0057        --|                --|        
9        0.0710   0.0356   22.607  0.0071          |                  |        
10       0.0155   0.0693   22.654  0.0121          |                  |        
11       0.0109  -0.0413   22.678  0.0196          |                  |        
12      -0.1508  -0.1064   27.246  0.0071         -|                  |        
13      -0.1038  -0.0743   29.425  0.0057          |                  |        
14      -0.1578  -0.1760   34.489  0.0017         -|                 -|        
15      -0.0282  -0.0665   34.651  0.0028          |                  |        
16       0.1201   0.1336   37.618  0.0017          |                  |-       
17      -0.1100  -0.0440   40.119  0.0012          |                  |        
18      -0.0610  -0.0418   40.893  0.0016          |                  |        
19      -0.0931  -0.0515   42.707  0.0014          |                  |        
20       0.0756  -0.0225   43.913  0.0015          |                  |        

. corrgram r_dlrgdp, lags(20)

                                          -1       0       1 -1       0       1
 LAG       AC       PAC      Q     Prob>Q  [Autocorrelation]  [Partial Autocor]
-------------------------------------------------------------------------------
1       -0.0570  -0.0571   .61306  0.4336          |                  |        
2        0.1238   0.1207    3.528  0.1714          |                  |        
3       -0.0915  -0.0796    5.127  0.1627          |                  |        
4        0.0709   0.0497   6.0915  0.1924          |                  |        
5       -0.1226  -0.0971   8.9974  0.1092          |                  |        
6       -0.0477  -0.0777   9.4386  0.1504          |                  |        
7        0.0142   0.0477   9.4778  0.2201          |                  |        
8       -0.0629  -0.0717   10.256  0.2475          |                  |        
9        0.0582   0.0538   10.924  0.2810          |                  |        
10      -0.0007   0.0174   10.924  0.3635          |                  |        
11       0.0836   0.0418   12.319  0.3402          |                  |        
12      -0.0683  -0.0435   13.256  0.3507          |                  |        
13       0.0627   0.0235   14.052  0.3702          |                  |        
14      -0.0703  -0.0414   15.056  0.3744          |                  |        
15      -0.1365  -0.1692   18.864  0.2200         -|                 -|        
16       0.1188   0.1643   21.769  0.1508          |                  |-       
17      -0.0871  -0.0666    23.34  0.1385          |                  |        
18       0.0852   0.0527   24.851  0.1291          |                  |        
19      -0.0929  -0.0390   26.659  0.1129          |                  |        
20       0.1813   0.0830   33.585  0.0291          |-                 |        

. corrgram r_dlrcons, lags(20)

                                          -1       0       1 -1       0       1
 LAG       AC       PAC      Q     Prob>Q  [Autocorrelation]  [Partial Autocor]
-------------------------------------------------------------------------------
1       -0.0284  -0.0286   .15284  0.6958          |                  |        
2        0.1355   0.1354   3.6406  0.1620          |-                 |-       
3        0.0853   0.0947   5.0297  0.1696          |                  |        
4        0.0116  -0.0016   5.0557  0.2816          |                  |        
5       -0.0138  -0.0380   5.0924  0.4047          |                  |        
6        0.0835   0.0755   6.4454  0.3752          |                  |        
7       -0.0812  -0.0723   7.7326  0.3568          |                  |        
8       -0.1469  -0.1784   11.974  0.1524         -|                 -|        
9       -0.0094  -0.0139   11.991  0.2138          |                  |        
10      -0.0011   0.0622   11.992  0.2856          |                  |        
11       0.0163   0.0569   12.045  0.3603          |                  |        
12      -0.0524  -0.0746   12.596  0.3991          |                  |        
13       0.0036  -0.0073   12.598  0.4793          |                  |        
14      -0.2015  -0.1855   20.856  0.1054         -|                 -|        
15       0.0068  -0.0228   20.866  0.1412          |                  |        
16       0.1512   0.2000   25.566  0.0604          |-                 |-       
17      -0.1086  -0.0764   28.006  0.0449          |                  |        
18       0.0523   0.0255   28.575  0.0538          |                  |        
19      -0.0903  -0.1231   30.281  0.0483          |                  |        
20      -0.0632  -0.0609   31.123  0.0536          |                  |        

. 
. * evidence of autocorrelation in residuals of investment *
. 
. /* The model with no autocorrelation is the one with 6 lags so we will keep that */
. 
. *****************************************************
. ********** PART 3: Granger causality tests ********** 
. *****************************************************
. 
. var dlrinv dlrgdp dlrcons, lags(1/6)

Vector autoregression

Sample:  1960q4 - 2005q4                        Number of obs     =        181
Log likelihood =  -595.1042                     AIC               =   7.205571
FPE            =   .2709742                     HQIC              =   7.613936
Det(Sigma_ml)  =   .1440068                     SBIC              =   8.212832

Equation           Parms      RMSE     R-sq      chi2     P>chi2
----------------------------------------------------------------
dlrinv               19      1.6595   0.3240    86.7694   0.0000
dlrgdp               19      .74305   0.3175   84.21454   0.0000
dlrcons              19     .659355   0.1531   32.72376   0.0180
----------------------------------------------------------------

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
dlrinv       |
      dlrinv |
         L1. |   .2063314   .0938619     2.20   0.028     .0223655    .3902972
         L2. |   .0861569   .0977694     0.88   0.378    -.1054676    .2777813
         L3. |  -.2008782   .0991036    -2.03   0.043    -.3951177   -.0066387
         L4. |   .1522449    .099154     1.54   0.125    -.0420934    .3465832
         L5. |    .239754   .0990884     2.42   0.016     .0455444    .4339637
         L6. |   .1272853    .099394     1.28   0.200    -.0675235     .322094
             |
      dlrgdp |
         L1. |   .1414824   .2530818     0.56   0.576    -.3545488    .6375135
         L2. |   .1466855   .2567418     0.57   0.568    -.3565192    .6498902
         L3. |   .0575081   .2505822     0.23   0.818     -.433624    .5486403
         L4. |  -.2971813   .2428788    -1.22   0.221     -.773215    .1788524
         L5. |  -.4719452   .2413215    -1.96   0.051    -.9449266    .0010362
         L6. |  -.8645394   .2252883    -3.84   0.000    -1.306096   -.4229825
             |
     dlrcons |
         L1. |   .4567163   .2578262     1.77   0.076    -.0486138    .9620463
         L2. |   .0157759   .2644088     0.06   0.952    -.5024559    .5340076
         L3. |   .2963489   .2615056     1.13   0.257    -.2161927    .8088905
         L4. |    .260005   .2615602     0.99   0.320    -.2526435    .7726536
         L5. |   .0292738   .2595157     0.11   0.910    -.4793676    .5379152
         L6. |   .3621748   .2456267     1.47   0.140    -.1192447    .8435943
             |
       _cons |   .1659434   .3737817     0.44   0.657    -.5666552     .898542
-------------+----------------------------------------------------------------
dlrgdp       |
      dlrinv |
         L1. |   .1503478   .0420272     3.58   0.000     .0679759    .2327196
         L2. |   .0453331   .0437769     1.04   0.300    -.0404679    .1311342
         L3. |  -.1124438   .0443743    -2.53   0.011    -.1994158   -.0254719
         L4. |   .0530896   .0443968     1.20   0.232    -.0339266    .1401058
         L5. |  -.0227628   .0443674    -0.51   0.608    -.1097214    .0641958
         L6. |   .0347808   .0445043     0.78   0.434     -.052446    .1220077
             |
      dlrgdp |
         L1. |  -.1827716    .113319    -1.61   0.107    -.4048726    .0393295
         L2. |  -.0568253   .1149578    -0.49   0.621    -.2821384    .1684878
         L3. |  -.0697697   .1121998    -0.62   0.534    -.2896772    .1501378
         L4. |  -.1211029   .1087505    -1.11   0.265      -.33425    .0920442
         L5. |  -.1481832   .1080532    -1.37   0.170    -.3599636    .0635973
         L6. |  -.1555549   .1008742    -1.54   0.123    -.3532648    .0421549
             |
     dlrcons |
         L1. |   .3529738   .1154433     3.06   0.002     .1267091    .5792385
         L2. |   .1670098   .1183907     1.41   0.158    -.0650317    .3990514
         L3. |   .1676035   .1170908     1.43   0.152    -.0618902    .3970973
         L4. |   .2205926   .1171152     1.88   0.060    -.0089491    .4501342
         L5. |   .0762089   .1161998     0.66   0.512    -.1515385    .3039563
         L6. |   .1069417   .1099809     0.97   0.331     -.108617    .3225003
             |
       _cons |   .3486516   .1673631     2.08   0.037      .020626    .6766773
-------------+----------------------------------------------------------------
dlrcons      |
      dlrinv |
         L1. |   .0144714   .0372934     0.39   0.698    -.0586223    .0875651
         L2. |  -.0422109   .0388459    -1.09   0.277    -.1183475    .0339258
         L3. |  -.0442178   .0393761    -1.12   0.261    -.1213934    .0329579
         L4. |   .0816162   .0393961     2.07   0.038     .0044013    .1588311
         L5. |    .055246     .03937     1.40   0.161    -.0219177    .1324098
         L6. |  -.0222237   .0394915    -0.56   0.574    -.0996255    .0551782
             |
      dlrgdp |
         L1. |   .1514437    .100555     1.51   0.132    -.0456404    .3485279
         L2. |   .1052251   .1020092     1.03   0.302    -.0947093    .3051594
         L3. |  -.1135586   .0995619    -1.14   0.254    -.3086963    .0815791
         L4. |  -.1721335   .0965011    -1.78   0.074    -.3612723    .0170052
         L5. |  -.0300825   .0958824    -0.31   0.754    -.2180085    .1578434
         L6. |  -.0553025    .089512    -0.62   0.537    -.2307428    .1201379
             |
     dlrcons |
         L1. |  -.0190308   .1024401    -0.19   0.853    -.2198096     .181748
         L2. |   .1675693   .1050555     1.60   0.111    -.0383357    .3734743
         L3. |   .2173539    .103902     2.09   0.036     .0137098    .4209981
         L4. |   .0500539   .1039237     0.48   0.630    -.1536328    .2537405
         L5. |  -.0708227   .1031113    -0.69   0.492    -.2729172    .1312718
         L6. |   .0717348   .0975929     0.74   0.462    -.1195438    .2630134
             |
       _cons |   .5802631   .1485117     3.91   0.000     .2891854    .8713407
------------------------------------------------------------------------------

. vargranger

   Granger causality Wald tests
  +------------------------------------------------------------------+
  |          Equation           Excluded |   chi2     df Prob > chi2 |
  |--------------------------------------+---------------------------|
  |            dlrinv             dlrgdp |  16.453     6    0.012    |
  |            dlrinv            dlrcons |  8.3024     6    0.217    |
  |            dlrinv                ALL |  30.926    12    0.002    |
  |--------------------------------------+---------------------------|
  |            dlrgdp             dlrinv |  24.634     6    0.000    |
  |            dlrgdp            dlrcons |  16.228     6    0.013    |
  |            dlrgdp                ALL |  51.837    12    0.000    |
  |--------------------------------------+---------------------------|
  |           dlrcons             dlrinv |  8.3244     6    0.215    |
  |           dlrcons             dlrgdp |  8.1708     6    0.226    |
  |           dlrcons                ALL |  14.685    12    0.259    |
  +------------------------------------------------------------------+

. * H0: variable _excluded_ does not granger cause _Equation_ *
. /* 
> dlrgdp granger causes dlrinv 
> both gdp and cons jointly granger cause dlrinv 
> 
> inv, consumption, and jointly granger cause gdp
> 
> inv, gdp nor jointly granger cause consumption
> */
. 
. 
. 
. ********************************************************
. ********** PART 4: Impulse response functions ********** 
. ********************************************************
. 
. * 1. growth rate of consumption responds to a one time positive shock in gr of incom
> e
. * 2. growth rate of investment responds to one time positive shock in the growth rat
> e of consumption
. irf create myirf, step(20) set(myirfs, replace) 
(file myirfs.irf created)
(file myirfs.irf now active)
(file myirfs.irf updated)

. 
. *1*
. irf graph oirf, impulse(dlrgdp) response(dlrcons)

. /* 
> One standard deviation shock of gdp rises consumption about .3 percentage points the
>  first quarter and then .1 in the next. Then 0 (when gray area touches zero)
> */
. 
. *2*
. irf graph oirf, impulse(dlrcons) response(dlrinv)

. /*
> Even though blue line goes up, the gray area (confidence interval) never stops touch
> ing zero, so an unexpected shock in consumption has no effect on investment. Reason:
>  firms could think the shock in consumption is temporal so they don't invest.
> */
. 
. ******************************************************************
. ********** PART 5: Estimate an exactlty identified SVAR ********** 
. ******************************************************************
. 
. * '\' represents a row change *
. matrix A = (1,0,0 \ .,1,0 \ .,.,1)

. matrix B = (.,0,0 \ 0,.,0 \ 0,0,.)

. 
. *structural var*
. svar dlrinv dlrgdp dlrcons, aeq(A) beq(B) lags(1/6)
Estimating short-run parameters

Iteration 0:   log likelihood = -1510.6152  
Iteration 1:   log likelihood = -1264.2436  
Iteration 2:   log likelihood =  -1004.098  
Iteration 3:   log likelihood = -775.61446  
Iteration 4:   log likelihood = -634.72867  
Iteration 5:   log likelihood = -597.18397  
Iteration 6:   log likelihood = -595.12762  
Iteration 7:   log likelihood = -595.10416  
Iteration 8:   log likelihood = -595.10416  

Structural vector autoregression

 ( 1)  [/A]1_1 = 1
 ( 2)  [/A]1_2 = 0
 ( 3)  [/A]1_3 = 0
 ( 4)  [/A]2_2 = 1
 ( 5)  [/A]2_3 = 0
 ( 6)  [/A]3_3 = 1
 ( 7)  [/B]1_2 = 0
 ( 8)  [/B]1_3 = 0
 ( 9)  [/B]2_1 = 0
 (10)  [/B]2_3 = 0
 (11)  [/B]3_1 = 0
 (12)  [/B]3_2 = 0

Sample:  1960q4 - 2005q4                        Number of obs     =        181
Exactly identified model                        Log likelihood    =  -595.1042

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
/A           |
         1_1 |          1  (constrained)
         2_1 |  -.2868243   .0255565   -11.22   0.000    -.3369142   -.2367345
         3_1 |  -.0629795   .0276076    -2.28   0.023    -.1170893   -.0088696
         1_2 |          0  (constrained)
         2_2 |          1  (constrained)
         3_2 |  -.5181778   .0616576    -8.40   0.000    -.6390246   -.3973311
         1_3 |          0  (constrained)
         2_3 |          0  (constrained)
         3_3 |          1  (constrained)
-------------+----------------------------------------------------------------
/B           |
         1_1 |   1.569981   .0825164    19.03   0.000     1.408252     1.73171
         2_1 |          0  (constrained)
         3_1 |          0  (constrained)
         1_2 |          0  (constrained)
         2_2 |   .5398032   .0283714    19.03   0.000     .4841962    .5954101
         3_2 |          0  (constrained)
         1_3 |          0  (constrained)
         2_3 |          0  (constrained)
         3_3 |   .4477768   .0235346    19.03   0.000     .4016498    .4939038
------------------------------------------------------------------------------

. 
. *If you want to see the estimated A and B matrices
. matlist e(A)

             |    dlrinv     dlrgdp    dlrcons 
-------------+---------------------------------
      dlrinv |         1          0          0 
      dlrgdp | -.2868243          1          0 
     dlrcons | -.0629795  -.5181778          1 

. matlist e(B)

             |    dlrinv     dlrgdp    dlrcons 
-------------+---------------------------------
      dlrinv |  1.569981                       
      dlrgdp |         0   .5398032            
     dlrcons |         0          0   .4477768 

. 
. *** dlrcons = 0.06 dlrinv + 0.52 dlrgdp ***
. * This relation does holds. Proven!
. 
. 
end of do-file

. log close
      name:  <unnamed>
       log:  C:\Users\Diego\Desktop\facu\Decimo semestre\Macroeconomía aplicada\Task 4
> \log.txt
  log type:  text
 closed on:   3 Mar 2023, 15:31:11
--------------------------------------------------------------------------------------
